In [1]:
%load_ext sql
%sql ibm_db_sa://mng80479:VD2X2NNvhWqLPRAZ@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB?security=SSL

In [3]:
%sql SELECT TABNAME FROM SYSCAT.TABLES WHERE TABSCHEMA = 'MNG80479'

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
Done.

[('CARS',),
 ('PHONES',),
 ('HOUSES',),
 ('CHICAGO_SCHOOLS',),
 ('SOCIOECONOMIC',),
 ('SOCIOECONOMIC_DATA',),
 ('CRIME',)]

In [4]:
%%sql
SELECT COLNAME, TYPENAME, LENGTH, SCALE, NULLS
FROM SYSCAT.COLUMNS
WHERE TABNAME = 'CARS'

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
Done.

[('ID', 'SMALLINT', 2, 0, 'N'),
 ('SYMBOLING', 'SMALLINT', 2, 0, 'Y'),
 ('NORMALIZED_LOSSES', 'SMALLINT', 2, 0, 'Y'),
 ('MAKE', 'VARCHAR', 13, 0, 'Y'),
 ('NUM_OF_DOORS', 'VARCHAR', 4, 0, 'Y'),
 ('BODY_STYLE', 'VARCHAR', 11, 0, 'Y'),
 ('DRIVE_WHEELS', 'VARCHAR', 3, 0, 'Y'),
 ('ENGINE_LOCATION', 'VARCHAR', 5, 0, 'Y'),
 ('WHEEL_BASE', 'DECIMAL', 5, 1, 'Y'),
 ('LENGTH', 'DECFLOAT', 16, 0, 'Y'),
 ('WIDTH', 'DECFLOAT', 16, 0, 'Y'),
 ('HEIGHT', 'DECFLOAT', 16, 0, 'Y'),
 ('CURB_WEIGHT', 'SMALLINT', 2, 0, 'Y'),
 ('ENGINE_TYPE', 'VARCHAR', 5, 0, 'Y'),
 ('NUM_OF_CYLINDERS', 'VARCHAR', 6, 0, 'Y'),
 ('ENGINE_SIZE', 'SMALLINT', 2, 0, 'Y'),
 ('FUEL_SYSTEM', 'VARCHAR', 4, 0, 'Y'),
 ('BORE', 'DECIMAL', 5, 2, 'Y'),
 ('STROKE', 'DECIMAL', 5, 2, 'Y'),
 ('COMPRESSION_RATIO', 'DECIMAL', 5, 2, 'Y'),
 ('HORSEPOWER', 'SMALLINT', 2, 0, 'Y'),
 ('PEAK_RPM', 'DECIMAL', 6, 1, 'Y'),
 ('PRICE', 'DECIMAL', 7, 1, 'Y'),
 ('CITY_L_100KM', 'DECFLOAT', 16, 0, 'Y'),
 ('HIGHWAY_L_100KM', 'DECFLOAT', 16, 0, 'Y'),
 ('HORSEPOWER_BINNED', 'VARCHAR', 6, 0, 'Y'),
 ('FUEL_TYPE_DIESEL', 'SMALLINT', 2, 0, 'Y'),
 ('FUEL_TYPE_GAS', 'SMALLINT', 2, 0, 'Y'),
 ('ASPIRATION_STD', 'SMALLINT', 2, 0, 'Y'),
 ('ASPIRATION_TURBO', 'SMALLINT', 2, 0, 'Y')]

In [5]:
%%sql 
ALTER TABLE CARS
RENAME COLUMN COLUMN_0 TO id

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
(ibm_db_dbi.ProgrammingError) ibm_db_dbi::ProgrammingError: Statement Execute Failed: [IBM][CLI Driver][DB2/LINUXX8664] SQL0205N  Column, attribute, or period "COLUMN_0" is not defined in "MNG80479.CARS".  SQLSTATE=42703  SQLCODE=-205
[SQL: ALTER TABLE CARS
RENAME COLUMN COLUMN_0 TO id]
(Background on this error at: http://sqlalche.me/e/13/f405)

In [6]:
%%sql
ALTER TABLE CARS
ALTER COLUMN ID SET NOT NULL

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
Done.

[]

In [7]:
%sql SELECT * FROM CARS LIMIT 5

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
Done.

[(0, 3, 122, 'alfa-romero', 'two', 'convertible', 'rwd', 'front', Decimal('88.6'), '0.8111484863046613', '0.8902777777777777', '0.8160535117056856', 2548, 'dohc', 'four', 130, 'mpfi', Decimal('3.47'), Decimal('2.68'), Decimal('9.00'), 111, Decimal('5000.0'), Decimal('13495.0'), '11.19047619047619', '8.703703703703704', 'Low', 0, 1, 1, 0),
 (1, 3, 122, 'alfa-romero', 'two', 'convertible', 'rwd', 'front', Decimal('88.6'), '0.8111484863046613', '0.8902777777777777', '0.8160535117056856', 2548, 'dohc', 'four', 130, 'mpfi', Decimal('3.47'), Decimal('2.68'), Decimal('9.00'), 111, Decimal('5000.0'), Decimal('16500.0'), '11.19047619047619', '8.703703703703704', 'Low', 0, 1, 1, 0),
 (2, 1, 122, 'alfa-romero', 'two', 'hatchback', 'rwd', 'front', Decimal('94.5'), '0.8226814031715521', '0.9097222222222222', '0.8762541806020067', 2823, 'ohcv', 'six', 152, 'mpfi', Decimal('2.68'), Decimal('3.47'), Decimal('9.00'), 154, Decimal('5000.0'), Decimal('16500.0'), '12.368421052631579', '9.038461538461538', 'Medium', 0, 1, 1, 0),
 (3, 2, 164, 'audi', 'four', 'sedan', 'fwd', 'front', Decimal('99.8'), '0.8486304661220567', '0.9194444444444445', '0.9080267558528428', 2337, 'ohc', 'four', 109, 'mpfi', Decimal('3.19'), Decimal('3.40'), Decimal('10.00'), 102, Decimal('5500.0'), Decimal('13950.0'), '9.791666666666666', '7.833333333333333', 'Low', 0, 1, 1, 0),
 (4, 2, 164, 'audi', 'four', 'sedan', '4wd', 'front', Decimal('99.4'), '0.8486304661220567', '0.9222222222222223', '0.9080267558528428', 2824, 'ohc', 'five', 136, 'mpfi', Decimal('3.19'), Decimal('3.40'), Decimal('8.00'), 115, Decimal('5500.0'), Decimal('17450.0'), '13.055555555555555', '10.681818181818182', 'Low', 0, 1, 1, 0)]

## Условие:

МОДИФИЦИРОВАНО ПОД ТЕКУЩУЮ ТАБЛИЦУ

1. Напишите запрос который вывел бы таблицу со столбцами в следующем порядке: make, price, 	engine_type, num_of_doors. (к первой или второй таблице, используя SELECT)

Воспользуюсь, так как выведет многовато строк без ограничений)

In [8]:
%sql select make, price, engine_type, num_of_doors from cars limit 10

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
Done.

[('alfa-romero', Decimal('13495.0'), 'dohc', 'two'),
 ('alfa-romero', Decimal('16500.0'), 'dohc', 'two'),
 ('alfa-romero', Decimal('16500.0'), 'ohcv', 'two'),
 ('audi', Decimal('13950.0'), 'ohc', 'four'),
 ('audi', Decimal('17450.0'), 'ohc', 'four'),
 ('audi', Decimal('15250.0'), 'ohc', 'two'),
 ('audi', Decimal('17710.0'), 'ohc', 'four'),
 ('audi', Decimal('18920.0'), 'ohc', 'four'),
 ('audi', Decimal('23875.0'), 'ohc', 'four'),
 ('bmw', Decimal('16430.0'), 'ohc', 'two')]

2. Напишите команду SELECT, которая вывела бы цену(price), сопровождаемую наименованием марки автомобиля, КОТОРЫЕ ЯВЛЯЮТСЯ СЕДАНАМИ.

In [9]:
%%sql
SELECT Price, Make, body_style FROM CARS WHERE body_style ='sedan' limit 10

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
Done.

[(Decimal('13950.0'), 'audi', 'sedan'),
 (Decimal('17450.0'), 'audi', 'sedan'),
 (Decimal('15250.0'), 'audi', 'sedan'),
 (Decimal('17710.0'), 'audi', 'sedan'),
 (Decimal('23875.0'), 'audi', 'sedan'),
 (Decimal('16430.0'), 'bmw', 'sedan'),
 (Decimal('16925.0'), 'bmw', 'sedan'),
 (Decimal('20970.0'), 'bmw', 'sedan'),
 (Decimal('21105.0'), 'bmw', 'sedan'),
 (Decimal('24565.0'), 'bmw', 'sedan')]

3. Напишите запрос, который вывел бы наименования всех производителей из таблицы автомобилей без каких бы то ни было повторений. (уникальные значения в “make“ “cars”)

In [10]:
%%sql
SELECT DISTINCT(make), COUNT(*) AS car_count
FROM cars
GROUP BY make

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
Done.

[('alfa-romero', 3),
 ('audi', 6),
 ('bmw', 8),
 ('chevrolet', 3),
 ('dodge', 9),
 ('honda', 13),
 ('isuzu', 2),
 ('jaguar', 3),
 ('mazda', 17),
 ('mercedes-benz', 8),
 ('mercury', 1),
 ('mitsubishi', 13),
 ('nissan', 18),
 ('peugot', 11),
 ('plymouth', 7),
 ('porsche', 4),
 ('saab', 6),
 ('subaru', 12),
 ('toyota', 32),
 ('volkswagen', 12),
 ('volvo', 11)]

4*. Напишите запрос, который бы выбирал Производителей, чьи наименования начинаются с буквы p. Используется оператор "LIKE":

In [11]:
%%sql
SELECT distinct(MAKE) FROM CARS 
WHERE MAKE LIKE 'p%'

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
Done.

[('peugot',), ('plymouth',), ('porsche',)]

5. Напишите запрос, который может дать вам все цены со значениями суммы выше чем $40,000.

In [12]:
%%sql
SELECT MAKE, price FROM CARS WHERE price > 40000

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
Done.

[('bmw', Decimal('41315.0')),
 ('mercedes-benz', Decimal('40960.0')),
 ('mercedes-benz', Decimal('45400.0'))]

6. Напишите запрос который выбрал бы наименьшую цену

In [14]:
%sql SELECT MIN(price) AS min_price from cars

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
Done.

[(Decimal('5118.0'),)]

Или субселектом

In [18]:
%%sql 
SELECT * from cars where price in (SELECT MIN(price) from cars)

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
Done.

[(134, 2, 83, 'subaru', 'two', 'hatchback', 'fwd', 'front', Decimal('93.7'), '0.7539644401729938', '0.8805555555555555', '0.8979933110367894', 2050, 'ohcf', 'four', 97, '2bbl', Decimal('3.62'), Decimal('2.36'), Decimal('9.00'), 69, Decimal('4900.0'), Decimal('5118.0'), '7.580645161290323', '6.527777777777778', 'Low', 0, 1, 1, 0)]


7. Напишите запрос к табличке “машины”, который может показать всех атомобили, у которых normalized_losses больше 200 и они не в Тойоты или Субару.

In [22]:
%%sql
SELECT MAKE, NORMALIZED_LOSSES 
FROM CARS 
WHERE NORMALIZED_LOSSES > 200
AND MAKE NOT IN ('toyota', 'subaru')

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
Done.

[('nissan', 231), ('volkswagen', 256)]


Отсортируйте поле “цена” в порядке убывания и возрастания (лимитирую выборку сразу, так как строк очень много)

In [24]:
%%sql
SELECT MAKE, price
FROM CARS 
order by price
limit 5

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
Done.

[('subaru', Decimal('5118.0')),
 ('chevrolet', Decimal('5151.0')),
 ('mazda', Decimal('5195.0')),
 ('toyota', Decimal('5348.0')),
 ('mitsubishi', Decimal('5389.0'))]

In [26]:
%%sql
SELECT MAKE, price
FROM CARS 
order by price desc
limit 5

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
Done.

[('mercedes-benz', Decimal('45400.0')),
 ('bmw', Decimal('41315.0')),
 ('mercedes-benz', Decimal('40960.0')),
 ('porsche', Decimal('37028.0')),
 ('bmw', Decimal('36880.0'))]

Выполните группировку всех автомобилей по марке , суммарная цена которых превышает 250 000

In [32]:
%%sql
SELECT MAKE, SUM(PRICE) AS SUM_PRICE
FROM CARS 
GROUP BY MAKE
HAVING SUM(PRICE) >250000

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
Done.

[('mercedes-benz', Decimal('269176.0')), ('toyota', Decimal('316346.0'))]